Repository: duxweb/dmux
Catalog: Sources/DmuxWorkspace/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# files.preview.search.replace_all
source: Replace all
de: Alle ersetzen
es: Reemplazar todo
fr: Tout remplacer
ja: すべて置換
ko: 모두 바꾸기
pt_br: Substituir tudo
ru: Заменить все
zh_hans: 全部替换
zh_hant: 全部取代

# ai.breakdown.tool_ranking
source: Tool Ranking
es: Clasificación de herramientas
fr: Classement des outils
ja: ツールランキング
ko: 도구 순위
pt_br: Classificação de ferramentas
ru: Рейтинг инструментов
zh_hans: 工具排行
zh_hant: 工具排行

# common.paste
source: Paste
es: Pasta
fr: Coller
ja: ペースト
ko: 반죽
pt_br: Colar
ru: Вставить
zh_hans: 粘贴
zh_hant: 貼上

# git.commit.action
source: Commit
es: Hacer commit
fr: Valider
ja: コミット
ko: 커밋
pt_br: Commitar
ru: Коммит
zh_hans: 提交
zh_hant: 提交

# git.remote.force_push
source: Force Push
es: Empuje forzado
fr: Forcer la poussée
ja: フォースプッシュ
ko: 강제 푸시
pt_br: Forçar impulso
ru: Силовой толчок
zh_hans: 强制推送
zh_hant: 強制推送

# rank.master
source: Limit
es: Límite
fr: Limite
ja: 限界
ko: 한계
pt_br: Limite
ru: Предел
zh_hans: 极限
zh_hant: 極限

# settings.shortcut.open_git_panel
source: Git Panel
es: Panel Git
fr: Panneau Git
ja: Git パネル
ko: Git 패널
pt_br: Painel Git
ru: Панель Git
zh_hans: Git 面板
zh_hant: Git 面板

# settings.terminal_text
source: Terminal Text
es: Texto del terminal
fr: Texte du terminal
ja: ターミナル文字
ko: 터미널 텍스트
pt_br: Texto do terminal
ru: Текст терминала
zh_hans: 终端文字
zh_hant: 終端文字

# settings.notifications.channel.bark.endpoint
source: Server URL
es: URL del servidor
fr: URL du serveur
ja: サーバー URL
ko: 서버 URL
pt_br: URL do servidor
ru: URL сервера
zh_hans: 服务器地址
zh_hant: 伺服器地址

# settings.notifications.channel.dingtalk.endpoint
source: Webhook URL
es: URL del webhook
fr: URL du webhook
pt_br: URL do webhook
ru: URL webhook
zh_hans: Webhook 地址
zh_hant: Webhook 位址

# settings.notifications.channel.discord.endpoint
source: Webhook URL
es: URL del webhook
fr: URL du webhook
pt_br: URL do webhook
ru: URL webhook
zh_hans: Webhook 地址
zh_hant: Webhook 位址

# settings.notifications.channel.feishu.endpoint
source: Webhook URL
es: URL del webhook
fr: URL du webhook
pt_br: URL do webhook
ru: URL webhook
zh_hans: Webhook 地址
zh_hant: Webhook 位址

# settings.notifications.channel.slack.endpoint
source: Webhook URL
es: URL del webhook
fr: URL du webhook
pt_br: URL do webhook
ru: URL webhook
zh_hans: Webhook 地址
zh_hant: Webhook 位址

# settings.notifications.channel.wecom.endpoint
source: Webhook URL
es: URL del webhook
fr: URL du webhook
pt_br: URL do webhook
ru: URL webhook
zh_hans: Webhook 地址
zh_hant: Webhook 位址

# settings.notifications.channel.wxpusher.endpoint
source: SPT Token
es: Token SPT
fr: Jeton SPT
ja: SPT トークン
ko: SPT 토큰
pt_br: Token SPT
ru: SPT-токен
zh_hans: SPT 标识
zh_hant: SPT 標識

# settings.terminal_background.preset.obsidian
source: Obsidian
es: Obsidiana
fr: Obsidienne
ja: オブシディアン
ko: 흑요석
pt_br: Obsidiana
ru: Обсидиан
zh_hans: 曜石
zh_hant: 黑曜石

# settings.terminal_background.preset.sand
source: Sand
es: Arena
fr: Sable
ja: サンド
ko: 모래
pt_br: Areia
ru: Песок
zh_hans: 沙砾
zh_hant: 沙礫

# titlebar.tab
source: Tab
es: Pestaña
fr: Onglet
ja: タブ
ko: 탭
pt_br: Aba
ru: Вкладка
zh_hans: 标签页
zh_hant: 分頁

# settings.developer.performance_monitor
source: Performance Monitor HUD
es: HUD del monitor de rendimiento
fr: HUD du moniteur de performances
ja: パフォーマンスモニター HUD
ko: 성능 모니터 HUD
pt_br: HUD do monitor de desempenho
ru: HUD монитора производительности
zh_hans: 性能监控 HUD
zh_hant: 效能監控 HUD

# pet.persona.observer
source: Null Signal
es: Señal nula
fr: Signal nul
ja: ヌルシグナル
ko: 널 시그널
pt_br: Sinal nulo
ru: Нулевой сигнал
zh_hans: 空信号
zh_hant: 空訊號

# pet.persona.mad_scientist
source: Rogue Compiler
es: Compilador rebelde
fr: Compilateur renégat
ja: ローグコンパイラ
ko: 로그 컴파일러
pt_br: Compilador rebelde
ru: Мятежный компилятор
zh_hans: 叛逆编译器
zh_hant: 叛逆編譯器

# settings.remote.server
source: Server
es: Servidor
fr: Serveur
ja: サーバー
ko: 서버
pt_br: Servidor
ru: Сервер
zh_hans: 远程服务
zh_hant: 遠端服務

# settings.remote.server_url
source: Relay Server URL
es: URL del servidor de retransmisión
fr: URL du serveur relais
ja: リレーサーバー URL
ko: 릴레이 서버 URL
pt_br: URL do servidor de retransmissão
ru: URL relay-сервера
zh_hans: 中继服务器地址
zh_hant: 中繼伺服器位址

# settings.remote.code
source: Code
es: Código
ja: コード
ko: 코드
pt_br: Código
ru: Код
zh_hans: 配对码
zh_hant: 配對碼

# remote.devices.online
source: Online
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
ru: Онлайн
zh_hans: 在线
zh_hant: 在線

# remote.devices.offline
source: Offline
es: Sin conexión
fr: Hors ligne
ja: オフライン
ko: 오프라인
ru: Офлайн
zh_hans: 离线
zh_hant: 離線

# pet.species.chaossprite.base
source: Chaos
es: Caos
ja: カオス
ko: 카오스
pt_br: Caos
ru: Хаос
zh_hans: 混沌
zh_hant: 混沌

# settings.ai.local_model.profile.pet
source: Pet
es: Mascota
fr: Compagnon
ja: ペット
ko: 펫
ru: Питомец
zh_hans: 宠物
zh_hant: 寵物

# settings.ai.local_model.profile.code_review
source: Code Review
es: Revisión de código
fr: Revue de code
ja: コードレビュー
ko: 코드 리뷰
pt_br: Revisão de código
zh_hans: 代码 Review
zh_hant: 程式碼 Review

# settings.ai.local_model.profile.reasoning
source: Reasoning
es: Razonamiento
fr: Raisonnement
ja: 推論
ko: 추론
pt_br: Raciocínio
ru: Рассуждение
zh_hans: 推理
zh_hant: 推理

# settings.ai.local_model.download_route
source: Download Route
es: Ruta de descarga
fr: Canal de téléchargement
ja: ダウンロード経路
ko: 다운로드 경로
pt_br: Rota de download
ru: Маршрут загрузки
zh_hans: 下载线路
zh_hant: 下載線路

# settings.ai.local_model.download_route.international
source: International
es: Internacional
ja: 国際
ko: 국제
pt_br: Internacional
ru: Международный
zh_hans: 国际
zh_hant: 國際

# settings.notifications.channel.telegram.endpoint
source: Chat ID
fr: ID du chat

# settings.notifications.channel.telegram.token
source: Bot Token
fr: Jeton du bot
ru: Токен бота

# settings.ai.local_model.download_route.china
source: China
fr: Chine
ja: 中国
ko: 중국
ru: Китай
zh_hans: 中国
zh_hant: 中國

# ai.metric.token
source: Token
ja: トークン
ko: 토큰
ru: Токен

# settings.interval.minutes_format
source: %@ min
ja: %@ 分
ko: %@ 분
ru: %@ мин.
zh_hans: %@ 分钟
zh_hant: %@ 分鐘

# settings.theme.auto
source: Auto
ja: 自動
ko: 자동
ru: Авто
zh_hans: 跟随系统
zh_hant: 自動

# workspace.bottom_terminal.title
source: Terminal
ja: ターミナル
ko: 터미널
ru: Терминал
zh_hans: 终端
zh_hant: 終端

# pet.species.voidcat.base
source: Mimi
ja: ミミ
ko: 미미
ru: Мими
zh_hans: 喵喵
zh_hant: 喵喵

# pet.claim.voidcat.title
source: Mimi
ja: ミミ
ko: 미미
ru: Мими
zh_hans: 喵喵
zh_hant: 喵喵

# settings.pet.speech.cooldown.minutes_format
source: %d min
ja: %d分
ko: %d분
ru: %d мин
zh_hans: %d 分钟
zh_hant: %d 分鐘

# pet.speech.mode.chuunibyou
source: Chuunibyou
ja: 中二
ko: 중2병
ru: Тюнибё
zh_hans: 中二
zh_hant: 中二

# pet.speech.frequency.normal
source: Normal
ja: 普通
ko: 보통
ru: Обычно
zh_hans: 适中
zh_hant: 適中

# pet.species.dragon.base
source: Drako
ja: ドラコ
ko: 드라코
ru: Драко
zh_hans: 龙宝
zh_hant: 龍寶

# pet.species.penguin.base
source: Pingu
ja: ペンペン
ko: 펭펭
ru: Пингу
zh_hans: 冰冰
zh_hant: 冰冰

# files.preview.search.regexp
source: Regex
ja: 正则表达式
ko: 정규식
zh_hans: 正则
zh_hant: 正則

# terminal.tab.rename.message
source: Set a short label for this bottom terminal tab.
ja: この下部ターミナルタブの短い名前を設定します。
ko: 이 하단 터미널 탭의 짧은 이름을 설정합니다.
zh_hans: 为这个底部终端标签设置一个简短名称。
zh_hant: 為這個底部終端機分頁設定一個簡短名稱。

# terminal.tab.rename.placeholder
source: Tab Name
ja: タブ名
ko: 탭 이름
zh_hans: 标签名称
zh_hant: 分頁名稱

# terminal.tab.rename.success
source: Renamed tab.
ja: タブ名を変更しました。
ko: 탭 이름을 변경했습니다.
zh_hans: 已重命名标签页。
zh_hant: 已重新命名分頁。

# terminal.tab.rename.title
source: Rename Tab
ja: タブ名を変更
ko: 탭 이름 변경
zh_hans: 重命名标签页
zh_hant: 重新命名分頁

# workspace.top_pane.created
source: Created a new terminal pane.
ja: 新しいターミナルペインを作成しました。
ko: 새 터미널 패널을 만들었습니다.
zh_hans: 已创建新的终端分屏。
zh_hant: 已建立新的終端機分割。

# workspace.top_pane.full_added_bottom_tab
source: Top row is full, added a bottom tab instead.
ja: 上段がいっぱいのため、下部タブに追加しました。
ko: 상단 영역이 가득 차 하단 탭으로 추가했습니다.
zh_hans: 顶部区域已满，已改为添加到底部标签页。
zh_hant: 頂部區域已滿，已改為新增到底部分頁。

# common.ok
source: OK
ko: 확인
zh_hans: 好的
zh_hant: 好的

# startup.recovery.invalid_state
source: The saved app configuration was invalid and has been reset to defaults.
zh_hans: 检测到已保存的应用配置无效，现已恢复为默认配置。

# startup.recovery.invalid_state.backup_format
source: The saved app configuration was invalid and has been reset to defaults. A backup was saved as %@.
zh_hans: 检测到已保存的应用配置无效，现已恢复为默认配置，并已备份为 %@。

# startup.recovery.sanitized
source: Some saved projects or terminal layout data were invalid and were repaired automatically.
zh_hans: 部分已保存的项目或终端布局数据存在异常，现已自动修复。

# startup.recovery.status
source: Recovered invalid saved app data.
zh_hans: 已恢复异常的应用保存数据。

# startup.recovery.title
source: Recovered App Data
zh_hans: 已恢复应用数据

# app.window.main_missing
source: Unable to find the main window.
zh_hans: 无法找到主窗口。
zh_hant: 找不到主視窗。

# common.add
source: Add
zh_hans: 添加
zh_hant: 新增

# common.close
source: Close
zh_hans: 关闭
zh_hant: 關閉

# common.continue
source: Continue
zh_hans: 继续
zh_hant: 繼續

# common.merge
source: Merge
zh_hans: 合并
zh_hant: 合併

# common.next
source: Next
zh_hans: 下一步
zh_hant: 下一步

# common.sync
source: Sync
zh_hans: 同步
zh_hant: 同步

# common.undo
source: Undo
zh_hans: 撤销
zh_hant: 復原

# git.branch.create_from_commit.title
source: Create Branch from Commit
zh_hans: 从提交创建分支
zh_hant: 從提交建立分支

# git.branch.current_label
source: Current Branch
zh_hans: 当前分支
zh_hant: 目前分支

# git.branch.merge.message_format
source: Merge %@ into %@.
zh_hans: 将 %@ 合并到 %@。
zh_hant: 將 %@ 合併到 %@。

# git.branch.merge.title
source: Merge Branch
zh_hans: 合并分支
zh_hant: 合併分支

# git.clone.message
source: Enter a remote repository URL to clone it into the current project directory.
zh_hans: 输入远程仓库 URL，将它克隆到当前项目目录。
zh_hant: 輸入遠端倉庫 URL，將它複製到目前專案目錄。

# git.clone.preparing
source: Preparing to clone the repository...
zh_hans: 正在准备克隆仓库…
zh_hant: 正在準備複製倉庫…

# git.clone.start
source: Start Clone
zh_hans: 开始克隆
zh_hant: 開始複製

# git.commit.generate.more_files_format
source: and %@ more files
zh_hans: 等 %@ 个文件
zh_hant: 等 %@ 個檔案

# git.commit.generate.success
source: Generated commit message.
zh_hans: 已生成提交信息。
zh_hant: 已產生提交訊息。

# git.commit.generate.summary_format
source: Update %@%@ Git workspace interaction
zh_hans: 更新 %@%@ 的 Git 工作区交互
zh_hant: 更新 %@%@ 的 Git 工作區互動

# git.commit.generate.unavailable
source: There are no changes available to generate a commit message.
zh_hans: 当前没有可生成提交信息的变更。
zh_hant: 目前沒有可產生提交訊息的變更。

# git.commit.hash.copied
source: Copied commit hash.
zh_hans: 已复制提交哈希。
zh_hant: 已複製提交雜湊。

# git.commit.message.empty
source: Commit message cannot be empty.
zh_hans: 提交信息不能为空。
zh_hant: 提交訊息不能為空。

# git.credentials.message
source: Remote access requires authentication. Enter your username and password or token to retry.
zh_hans: 访问远程仓库需要认证，请输入用户名和密码或令牌后重试。
zh_hant: 存取遠端倉庫需要驗證，請輸入使用者名稱與密碼或權杖後再試一次。

# git.credentials.title
source: Git Credentials Required
zh_hans: 需要 Git 凭证
zh_hant: 需要 Git 憑證

# git.diff.loading
source: Loading diff...
zh_hans: 正在加载差异…
zh_hant: 正在載入差異…

# git.discard.section.success
source: Discarded changes in this section.
zh_hans: 已丢弃这个分组中的改动。
zh_hant: 已捨棄這個分組中的變更。

# git.discard.selected.success
source: Discarded selected changes.
zh_hans: 已丢弃选中的改动。
zh_hant: 已捨棄所選變更。

# git.empty.select_project
source: Add or select a project to view Git status.
zh_hans: 添加或选择项目后即可查看 Git 状态。
zh_hant: 新增或選擇專案後即可查看 Git 狀態。

# git.history.restore_local.action
source: Local Restore
zh_hans: 本地恢复
zh_hant: 本機還原

# git.history.restore_local.message
source: Reset the current branch to this revision locally only.
zh_hans: 仅在本地将当前分支重置到这个版本。
zh_hant: 只在本機將目前分支重設到這個版本。

# git.history.restore_remote.action
source: Remote Restore
zh_hans: 远程恢复
zh_hant: 遠端還原

# git.history.restore_remote.message
source: Reset the current branch to this revision and overwrite the remote branch.
zh_hans: 将当前分支重置到这个版本，并覆盖远程分支。
zh_hant: 將目前分支重設到這個版本，並覆蓋遠端分支。

# git.history.rewrite_warning.defer
source: Handle Later
zh_hans: 稍后处理
zh_hant: 稍後處理

# git.history.rewrite_warning.force_push
source: Force Push Now
zh_hans: 立即强推
zh_hant: 立即強推

# git.history.rewrite_warning.message
source: Local history has changed. If the remote still contains the old commits, you may need to force push to sync it.
zh_hans: 本地历史已变化。如果远程仍保留旧提交，你可能需要强制推送来完成同步。
zh_hant: 本機歷史已變更。如果遠端仍保留舊提交，你可能需要強制推送來完成同步。

# git.history.undo_last_commit.local_notice
source: Undo the last commit but keep the file changes and staging state.
zh_hans: 撤销最后一次提交，但保留文件改动和暂存状态。
zh_hant: 復原最後一次提交，但保留檔案變更與暫存狀態。

# git.history.undo_last_commit.remote_notice
source: Undo the last commit but keep the file changes and staging state. This commit may already be on the remote, so you might need to force push later.
zh_hans: 撤销最后一次提交，但保留文件改动和暂存状态。这个提交可能已经推到远程，之后你可能还需要强制推送。
zh_hant: 復原最後一次提交，但保留檔案變更與暫存狀態。這次提交可能已經推到遠端，之後你可能還需要強制推送。

# git.main_branch.already_on
source: Already on the main branch.
zh_hans: 当前已经在主分支上。
zh_hant: 目前已在主分支上。

# git.main_branch.not_found
source: Main branch not found.
zh_hans: 未找到主分支。
zh_hant: 找不到主分支。

# git.main_branch.sync.message_format
source: Merge the latest changes from %@ into %@.
zh_hans: 将 %@ 的最新变更合并到 %@。
zh_hant: 將 %@ 的最新變更合併到 %@。

# git.main_branch.sync.title
source: Sync Main Branch
zh_hans: 同步主分支
zh_hant: 同步主分支

# git.remote.add.name_message
source: Enter the remote name first, such as origin or upstream.
zh_hans: 先输入远程名称，比如 origin 或 upstream。
zh_hant: 先輸入遠端名稱，例如 origin 或 upstream。

# git.remote.add.url_message
source: Enter the remote URL.
zh_hans: 输入远程 URL。
zh_hant: 輸入遠端 URL。

# git.remote.default_push.cleared
source: Restored the Git default push target.
zh_hans: 已恢复 Git 默认推送目标。
zh_hant: 已還原 Git 預設推送目標。

# git.remote.default_push.set_format
source: Set %@ as the default push remote.
zh_hans: 已将 %@ 设为默认推送远程。
zh_hant: 已將 %@ 設為預設推送遠端。

# git.remote.force_push.message
source: Overwrite the current remote branch. Only use this when you intentionally want to rewrite remote history.
zh_hans: 覆盖当前远程分支。只有在你明确要改写远程历史时才建议这样做。
zh_hant: 覆蓋目前遠端分支。只有在你明確要改寫遠端歷史時才建議這麼做。

# git.remote.matching_not_found
source: Matching remote was not found.
zh_hans: 未找到匹配的远程仓库。
zh_hant: 找不到相符的遠端倉庫。

# git.remote.name
source: Remote Name
zh_hans: 远程名称
zh_hant: 遠端名稱

# git.remote.remove.confirm_format
source: Are you sure you want to remove remote %@?
zh_hans: 确定要移除远程 %@ 吗？
zh_hant: 確定要移除遠端 %@ 嗎？

# git.stage.file.success_format
source: Staged %@.
zh_hans: 已暂存 %@。
zh_hant: 已暫存 %@。

# git.stage.section.success
source: Staged files in this section.
zh_hans: 已暂存这个分组中的文件。
zh_hant: 已暫存這個分組中的檔案。

# git.stage.selected.success
source: Staged selected files.
zh_hans: 已暂存选中的文件。
zh_hant: 已暫存所選檔案。

# git.sync.conflict.message
source: A conflict occurred while pulling. You can resolve it manually first, or force push the current branch directly.
zh_hans: 拉取时发生冲突。你可以先手动解决，也可以直接强制推送当前分支。
zh_hant: 拉取時發生衝突。你可以先手動解決，也可以直接強制推送目前分支。

# git.sync.conflict.resolve_manually
source: Resolve Manually
zh_hans: 手动解决
zh_hant: 手動解決

# git.sync.conflict.title
source: Sync Conflict
zh_hans: 同步冲突
zh_hant: 同步衝突

# git.unstage.file.success_format
source: Unstaged %@.
zh_hans: 已取消暂存 %@。
zh_hant: 已取消暫存 %@。

# git.unstage.section.success
source: Unstaged files in this section.
zh_hans: 已取消暂存这个分组中的文件。
zh_hant: 已取消暫存這個分組中的檔案。

# git.unstage.selected.success
source: Unstaged selected files.
zh_hans: 已取消暂存选中的文件。
zh_hant: 已取消暫存所選檔案。

# diagnostics.export.error.title
source: Unable to Export Diagnostics
zh_hans: 无法导出诊断包

# diagnostics.export.failed
source: Failed to export diagnostics.
zh_hans: 导出诊断包失败。

# diagnostics.export.panel.message
source: Choose where to save the diagnostics archive.
zh_hans: 请选择诊断包的保存位置。

# diagnostics.export.panel.title
source: Export Diagnostics
zh_hans: 导出诊断包

# diagnostics.export.running
source: Exporting diagnostics…
zh_hans: 正在导出诊断包…

# diagnostics.export.success_format
source: Exported diagnostics to %@.
zh_hans: 诊断包已导出到 %@。

# menu.help.export_diagnostics
source: Export Diagnostics…
zh_hans: 导出诊断包…

# project.add.success_format
source: Added project %@.
zh_hans: 已添加项目 %@。
zh_hant: 已新增專案 %@。

# project.close.success_format
source: Closed project %@.
zh_hans: 已关闭项目 %@。
zh_hant: 已關閉專案 %@。

# project.default_command.cleared
source: Cleared default startup command.
zh_hans: 已清空默认启动命令。
zh_hant: 已清除預設啟動命令。

# project.default_command.updated
source: Updated default startup command.
zh_hans: 已更新默认启动命令。
zh_hant: 已更新預設啟動命令。

# project.exists.switched
source: Project already exists. Switched to it.
zh_hans: 项目已存在，已切换到该项目。
zh_hant: 專案已存在，已切換到該專案。

# project.none_selected
source: No project selected.
zh_hans: 未选择项目。
zh_hant: 尚未選擇專案。

source: Project not found.
zh_hans: 未找到项目。
zh_hant: 找不到專案。

# project.open.folder.success
source: Opened project folder.
zh_hans: 已打开项目文件夹。
zh_hant: 已開啟專案資料夾。

# project.open.application.failure_format
source: %@ not found.
zh_hans: 未找到 %@。
zh_hant: 找不到 %@。

# project.open.application.success_format
source: Opened project in %@.
zh_hans: 已在 %@ 中打开项目。
zh_hant: 已在 %@ 中開啟專案。

# project.open.ghostty.failure
source: Ghostty not found.
zh_hans: 未找到 Ghostty。
zh_hant: 找不到 Ghostty。

# project.open.ghostty.success
source: Opened project in Ghostty.
zh_hans: 已在 Ghostty 中打开项目。
zh_hant: 已在 Ghostty 中開啟專案。

# project.open.iterm2.failure
source: iTerm2 not found.
zh_hans: 未找到 iTerm2。
zh_hant: 找不到 iTerm2。

# project.open.iterm2.success
source: Opened project in iTerm2.
zh_hans: 已在 iTerm2 中打开项目。
zh_hant: 已在 iTerm2 中開啟專案。

# project.open.terminal.failure
source: Terminal not found.
zh_hans: 未找到终端。
zh_hant: 找不到終端機。

# project.open.terminal.success
source: Opened project in Terminal.
zh_hans: 已在终端中打开项目。
zh_hant: 已在終端機中開啟專案。

# project.open.vscode.failure
source: Unable to find VS Code for this directory.
zh_hans: 当前目录未找到可用的 VS Code。
zh_hant: 目前目錄找不到可用的 VS Code。

# project.open.vscode.success
source: Opened project in VS Code.
zh_hans: 已在 VS Code 中打开项目。
zh_hant: 已在 VS Code 中開啟專案。

# project.open.xcode.failure
source: Xcode not found.
zh_hans: 未找到 Xcode。
zh_hant: 找不到 Xcode。

# project.open.xcode.success
source: Opened project in Xcode.
zh_hans: 已在 Xcode 中打开项目。
zh_hant: 已在 Xcode 中開啟專案。

# project.path.empty
source: Project path cannot be empty.
zh_hans: 项目路径不能为空。
zh_hant: 專案路徑不能為空。

# project.reveal.finder.success
source: Revealed project in Finder.
zh_hans: 已在访达中显示项目。
zh_hant: 已在 Finder 中顯示專案。

# settings.notifications.channel.dingtalk.title
source: DingTalk
zh_hans: 钉钉
zh_hant: 釘釘

# settings.notifications.channel.feishu.title
source: Feishu
zh_hans: 飞书
zh_hant: 飛書

# settings.notifications.channel.wecom.title
source: WeCom
zh_hans: 企业微信
zh_hant: 企業微信

# settings.terminal_theme
source: Terminal Theme
zh_hans: 终端主题
zh_hant: 終端主題

# settings.terminal_theme.preset.flexoki_dark
source: Flexoki Dark
zh_hans: Flexoki 深色
zh_hant: Flexoki 深色

# settings.terminal_theme.preset.flexoki_light
source: Flexoki Light
zh_hans: Flexoki 浅色
zh_hant: Flexoki 淺色

# settings.terminal_theme.preset.github_dark
source: GitHub Dark
zh_hans: GitHub 深色
zh_hant: GitHub 深色

# settings.terminal_theme.preset.gruvbox_dark
source: Gruvbox Dark
zh_hans: Gruvbox 深色
zh_hant: Gruvbox 深色

# settings.terminal_theme.preset.gruvbox_light
source: Gruvbox Light
zh_hans: Gruvbox 浅色
zh_hant: Gruvbox 淺色

# settings.terminal_theme.preset.gruvbox_material_dark
source: Gruvbox Material Dark
zh_hans: Gruvbox Material 深色
zh_hant: Gruvbox Material 深色

# settings.terminal_theme.preset.gruvbox_material_light
source: Gruvbox Material Light
zh_hans: Gruvbox Material 浅色
zh_hant: Gruvbox Material 淺色

# settings.terminal_theme.preset.nord_light
source: Nord Light
zh_hans: Nord 浅色
zh_hant: Nord 淺色

# settings.terminal_theme.restart_message
source: Restart Codux to apply the selected terminal theme to all terminals.
zh_hans: 重启 Codux 后，所选终端主题会应用到所有终端。
zh_hant: 重新啟動 Codux 後，所選終端主題會套用到所有終端。

# settings.terminal_theme.restart_pending
source: Terminal theme changes will apply after restart.
zh_hans: 终端主题会在重启后生效。
zh_hant: 終端主題會在重新啟動後生效。

# settings.terminal_theme.restart_required
source: Restart the app to apply the selected terminal theme.
zh_hans: 重启应用后才能应用所选终端主题。
zh_hant: 重新啟動 App 後才能套用所選終端主題。

# settings.terminal_theme.restart_title
source: Restart Required
zh_hans: 需要重启
zh_hant: 需要重新啟動

# settings.theme.restart_message
source: Restart Codux to apply the selected theme to the app and all terminals.
zh_hans: 重启 Codux 后，所选主题会应用到应用界面和所有终端。
zh_hant: 重新啟動 Codux 後，所選主題會套用到應用介面與所有終端。

# settings.theme.restart_pending
source: Theme changes will apply after restart.
zh_hans: 主题会在重启后生效。
zh_hant: 主題會在重新啟動後生效。

# settings.theme.restart_required
source: Restart the app to apply the selected theme.
zh_hans: 重启应用后才能应用所选主题。
zh_hant: 重新啟動 App 後才能套用所選主題。

# settings.theme.restart_title
source: Restart Required
zh_hans: 需要重启
zh_hant: 需要重新啟動

# task_memo.add
source: Add
zh_hans: 添加
zh_hant: 新增

# task_memo.added_status_format
source: Added task memo as %@.
zh_hans: 已添加为%@任务。
zh_hant: 已新增為%@任務。

# task_memo.input.placeholder
source: Add a task memo...
zh_hans: 添加一条任务备忘...
zh_hant: 新增一條任務備忘...

# task_memo.auto_sent
source: Sent the next queued task memo.
zh_hans: 已发送下一条队列任务。
zh_hant: 已傳送下一條佇列任務。

# task_memo.change_status
source: Change Status
zh_hans: 修改状态
zh_hant: 修改狀態

# task_memo.empty
source: Task memo cannot be empty.
zh_hans: 任务备忘不能为空。
zh_hant: 任務備忘不能為空。

# task_memo.empty.help
source: Queued memos are sent one by one after this session finishes an AI turn.
zh_hans: 队列任务会在此会话的 AI 回合完成后逐条发送。
zh_hant: 佇列任務會在此會話的 AI 回合完成後逐條傳送。

# task_memo.empty.title
source: No Task Memos
zh_hans: 暂无任务备忘
zh_hant: 暫無任務備忘

# task_memo.execute_failed
source: Unable to send this task memo.
zh_hans: 无法发送这条任务备忘。
zh_hant: 無法傳送這條任務備忘。

# task_memo.execute_now
source: Send Now
zh_hans: 立即执行
zh_hant: 立即執行

# task_memo.executed
source: Sent task memo.
zh_hans: 已发送任务备忘。
zh_hant: 已傳送任務備忘。

# task_memo.no_project
source: No Project Selected
zh_hans: 未选择项目
zh_hant: 未選擇專案

# task_memo.no_project.help
source: Select a project and terminal session to add task memos.
zh_hans: 选择项目和终端会话后添加任务备忘。
zh_hant: 選擇專案和終端會話後新增任務備忘。

# task_memo.open
source: Task Memos
zh_hans: 任务备忘
zh_hant: 任務備忘

# task_memo.panel.title
source: Task Memos
zh_hans: 任务备忘
zh_hant: 任務備忘

# task_memo.requeue
source: Requeue
zh_hans: 重新入队
zh_hant: 重新入列

# task_memo.session_missing
source: Unable to find this terminal session.
zh_hans: 找不到这个终端会话。
zh_hant: 找不到這個終端會話。

# task_memo.status.completed
source: Completed
zh_hans: 完成
zh_hant: 完成

# task_memo.status.queued
source: Queued
zh_hans: 队列
zh_hant: 佇列

# task_memo.status.waiting
source: Waiting
zh_hans: 等待
zh_hant: 等待

# task_memo.toggle_status
source: Change Status
zh_hans: 切换状态
zh_hant: 切換狀態

# terminal.closed
source: Closed terminal.
zh_hans: 已关闭终端。
zh_hant: 已關閉終端機。

# terminal.keep_one_open
source: At least one terminal must remain open.
zh_hans: 至少需要保留一个终端。
zh_hant: 至少要保留一個終端機。

# terminal.none_selected
source: No terminal selected.
zh_hans: 未选中终端。
zh_hant: 尚未選取終端機。

# workspace.bottom_split.created
source: Created the bottom split area.
zh_hans: 已创建底部分屏区域。
zh_hant: 已建立底部分割區域。

# workspace.bottom_tab.additional
source: Added a tab to the bottom split area.
zh_hans: 已在底部分屏区域添加标签页。
zh_hant: 已在底部分割區域新增分頁。

# workspace.bottom_tab.created
source: Added a new bottom tab.
zh_hans: 已新增底部标签页。
zh_hant: 已新增底部分頁。

# workspace.close_all_projects.confirm
source: Close All
zh_hans: 全部关闭
zh_hant: 全部關閉

# workspace.close_all_projects.message
source: Are you sure you want to close all projects in the current workspace? Files on disk will not be deleted.
zh_hans: 确定要关闭当前工作区中的全部项目吗？磁盘上的文件不会被删除。
zh_hant: 確定要關閉目前工作區中的所有專案嗎？磁碟上的檔案不會被刪除。

# workspace.close_all_projects.title
source: Close All Projects
zh_hans: 关闭全部项目
zh_hant: 關閉所有專案

# workspace.not_found
source: Current workspace not found.
zh_hans: 未找到当前工作区。
zh_hant: 找不到目前工作區。

# workspace.split.create_failed
source: Unable to create a new split pane.
zh_hans: 无法创建新的分屏。
zh_hant: 無法建立新的分割。

# workspace.top_pane.horizontal_created
source: Added a horizontal pane.
zh_hans: 已添加横向分屏。
zh_hant: 已新增橫向分割。

# workspace.top_pane.limit_format
source: The top row supports up to %@ panes.
zh_hans: 顶部一行最多支持 %@ 个分屏。
zh_hant: 頂部一列最多支援 %@ 個分割。
